//*****************************************************
//
// メッシュフィールドエディターの処理[editMeshfield.h]
// Author:髙山桃也
//
//*****************************************************

//*****************************************************
// インクルード
//*****************************************************
#include "edit.h"

//*****************************************************
// 前方宣言
//*****************************************************
// 
//*****************************************************
// クラスの定義
//*****************************************************
class CEditMeshfield : public CEdit
{
public:
	CEditMeshfield();	// コンストラクタ
	~CEditMeshfield();	// デストラクタ

	// メンバ関数
	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;

private:
	// メンバ関数

	// メンバ変数
};