//*****************************************************
//
// マニピュレーター[manipulater.h]
// Author:髙山桃也
//
//*****************************************************
#ifndef _MANIPULATER_H_
#define _MANIPULATER_H_

//*****************************************************
// インクルード
//*****************************************************
#include "objectX.h"

//*****************************************************
// 前方定義
//*****************************************************

//*****************************************************
// クラスの定義
//*****************************************************
class CManipulater : public CObjectX
{
public:
    CManipulater(int nPriority = 4);	// コンストラクタ
	~CManipulater();    // デストラクタ

    // メンバ関数
	HRESULT Init(void); // 初期化処理
	void Uninit(void);  // 終了処理
	void Update(void);  // 更新処理
	void Draw(void);    // 描画処理

    // 静的メンバ関数
    static CManipulater* Create();    // 生成処理

private:
	// メンバ関数

	// メンバ変数
};

#endif
